openFoamRepoDev/tutorials/heatTransfer/buoyantSimpleFoam/comfortHotRoom/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-7;
        relTol          0.1;
    }

    age
    {
        $U;
        relTol          0.001;
    }
}

SIMPLE
{
    momentumPredictor false;
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p_rgh           1e-6;
        U               1e-6;
        h               1e-6;
        "(k|epsilon)"   1e-6;
    }
}

relaxationFactors
{
    fields
    {
        p_rgh           0.7;
    }

    equations
    {
        U               0.3;
        h               0.3;
        "(k|epsilon|R)" 0.7;
        age             1;
    }
}


// ************************************************************************* //
